[["04 Jul 2025",[{"url":"https://www.theatlantic.com/newsletters/archive/2022/06/uber-ride-share-prices-high-inflation/661250/","last_moved_at":"2025-07-04T21:50:57.834Z","title":"The End of the Millennial Lifestyle Subsidy","summary":"The Millennial Consumer Subsidy, where companies like Uber offered low prices to attract customers, is ending. Rising interest rates and increased labor costs are making urban services more expensive. As a result, young city dwellers will have to pay full price for rides and other amenities moving forward."},{"url":"https://www.ettf.land/p/30-reflections","last_moved_at":"2025-07-04T17:11:29.932Z","title":"30 Reflections","summary":"The author reflects on the challenges of understanding oneself and controlling one's thoughts in a chaotic world. They emphasize the importance of taking simple actions and experimenting while recognizing the complexity of human values. Ultimately, the author believes in striving for a better, more humane future without sacrificing our values for progress."},{"url":"https://stratechery.com/2025/the-agentic-web-and-original-sin/","last_moved_at":"2025-07-04T21:49:18.139Z","title":"The Agentic Web and Original Sin","summary":"Advertising is seen as the \"original sin\" of the web, creating a reliance on ad-supported content that struggles to thrive today. As the internet evolves, there's a shift towards an \"Open Agentic Web\" with new digital payment models that could foster better content creation. However, the success of this new model depends on human interaction with content, which is threatened by automation and could limit the supply of new material."}]],["02 Jul 2025",[{"url":"https://www.nmccarty.com/p/what-i-learned-in-2024","last_moved_at":"2025-07-02T22:57:16.393Z","title":"What I Learned in 2024","summary":"In 2024, I learned about exciting advances in biology, including in ovo sexing, which helps farmers identify chick sexes before hatching to reduce suffering. Scientists are also making progress in creating viable eggs and sperm from stem cells, potentially expanding fertility options for many people. Additionally, research on bacteria shows they can anticipate seasonal changes, highlighting the remarkable adaptability of living organisms."},{"url":"private://read/01jmhrpf9y5fmxkzj9x3gkdvyx","last_moved_at":"2025-07-02T20:08:02.726Z","title":"The Mahabharata V1","summary":"Bheeshma is reminded to protect the Pandavas, as they are the kingdom's only hope. Meanwhile, Yudhishtira feels uneasy about the growing threat from Duryodhana and Karna. The Pandavas eventually rescue Duryodhana, but Karna vows to help him against Arjuna, promising to kill him."}]],["01 Jul 2025",[{"url":"https://academy.fpblock.com/blog/rust-haskell-reflections/?__readwiseLocation=","last_moved_at":"2025-07-01T13:11:18.741Z","title":"Reflections on Haskell and Rust","summary":"The author compares Haskell and Rust based on their experience in web services and APIs, noting Rust's practical advantages in tooling, error handling, and performance. Rust offers faster compilation, better formatting standards, and easier operational management than Haskell. While Haskell excels in purity and theoretical foundations, Rust's growing ecosystem and usability make it more suitable for maintainable production systems."}]],["25 Jun 2025",[{"url":"https://cancerhistoryproject.com/article/viral-oncologys-complicated-path-from-cancer-as-contagion-to-todays-immunotherapy/?utm_source=chatgpt.com","last_moved_at":"2025-06-25T16:54:37.225Z","title":"Viral oncology’s complicated path—from cancer as contagion to today’s immunotherapy","summary":"The study of viruses causing cancer was uncertain and controversial for many years. The National Cancer Institute funded research that helped discover links between viruses and cancer genetics. Today, this work supports new treatments like immunotherapy and cancer vaccines."},{"url":"https://pierrekorymedicalmusings.com/p/the-scientific-basis-for-the-somatic","last_moved_at":"2025-06-25T16:54:51.745Z","title":"The Scientific Basis For The Somatic Mutation Theory Of Cancer Is Invalid","summary":"The Somatic Mutation Theory (SMT) says cancer is caused by DNA mutations in cells. However, many studies show cancer cells often lack consistent mutations, challenging this theory. New evidence suggests cancer might arise from other causes, like changes in cell metabolism."}]],["23 Jun 2025",[{"url":"https://readwise.io/reader/document_raw_content/324219292","last_moved_at":"2025-06-23T21:39:00.650Z","title":"The Political Life Of Mutagens: A History Of The Ames Test","summary":"The Ames test, developed by Bruce N. Ames in 1973, is a method for identifying chemical carcinogens using mutant strains of Salmonella. It showed that many natural substances could be just as mutagenic as synthetic chemicals, challenging the belief that cancer was primarily caused by artificial substances. This test has influenced discussions about cancer risks and regulation in both scientific and political contexts."}]],["22 Jun 2025",[{"url":"https://scholars-stage.org/book-notes-stoner-1965/","last_moved_at":"2025-06-22T21:54:05.646Z","title":"Book Notes: Stoner (1965)","summary":"John Edward Williams' novel *Stoner* offers a unique perspective on middle-class life, finding dignity in the mundane struggles of its protagonist, William Stoner. Unlike many male authors, Williams portrays a life filled with quiet significance rather than dramatic events, emphasizing the moral worth in ordinary existence. While the novel excels in its writing and character depth, it sometimes leaves motivations unexplained, hinting at the complexities of communication and self-awareness."}]],["20 Jun 2025",[{"url":"https://theconversation.com/can-progress-studies-contribute-to-knowledge-history-suggests-caution-121410","last_moved_at":"2025-06-20T22:31:04.522Z","title":"Can ‘progress studies’ contribute to knowledge? History suggests caution","summary":"The idea of creating a new field called \"progress studies\" ignores that progress has been studied for centuries. History shows that claiming progress can hide harm, like social exclusion and environmental damage. We should study progress carefully, balancing hope with critical thinking to avoid repeating past mistakes."},{"url":"https://www.chemistryworld.com/opinion/the-most-feared-assays/3005014.article","last_moved_at":"2025-06-19T23:16:20.159Z","title":"The most-feared assays","summary":"Drug discovery relies on various assays to assess the safety and effectiveness of compounds. Some tests, like the Ames test and hERG test, are particularly feared because they can indicate serious issues that may halt drug development. Additionally, two-week rat toxicity testing provides crucial insights into potential side effects, making it a critical step in the drug development process."},{"url":"https://archive.ph/qSrH1","last_moved_at":"2025-06-20T22:36:38.910Z","title":"Exclusive | DNA Analysis Startup Nucleus Genomics Aims to Rank Embryo…","summary":"Nucleus Genomics is a DNA analysis startup that helps prospective parents rank embryos based on their genetic risks for diseases like heart disease and cancer. The service, which costs $5,999, analyzes up to 20 embryos and provides probabilities for various age-related conditions. This technology is part of a growing trend in the longevity community, aiming to enable families to choose embryos with better chances for a long, healthy life."},{"url":"https://barnacles.substack.com/p/understanding-as-an-art","last_moved_at":"2025-06-20T22:48:51.308Z","title":"Understanding as an art","summary":"Laura Deming reflects on her journey of understanding complex scientific concepts through vivid visualization and emotional experiences. She describes how moments of awe and curiosity allow her to connect deeply with the microscopic world, transforming her learning from mere facts into immersive adventures. Ultimately, she longs for the transcendent feelings of discovery and exploration that science can provide, even as she recognizes the practical challenges that accompany them."}]],["19 Jun 2025",[{"url":"https://www.fastcompany.com/91352848/field-notes-cult-notebook-started-out-as-a-side-project","last_moved_at":"2025-06-19T10:06:19.642Z","title":"How Field Notes went from side project to cult notebook","summary":"Field Notes started as a small project by Aaron Draplin and Jim Coudal in 2005 and has grown into a popular notebook brand, selling over 10 million notebooks worldwide. The duo's complementary skills helped them create a beloved product, with a strong focus on quality and design. Today, Field Notes thrives with a successful subscription model and continues to expand its reach and product offerings."},{"url":"https://martinfowler.com/articles/expert-generalist.html","last_moved_at":"2025-06-19T10:11:07.249Z","title":"Expert Generalists: first three characteristics","summary":"\nAs computer systems get more sophisticated we've seen a growing trend\n      to value deep specialists. But we've found that our most effective\n      colleagues have a skill that comes from spanning many specialties. We are thus starting\n      to explicitly recognize this as a first-class skill of “Expert\n      Generalist”. This is the first installment of an article detailing how we\n      think about this skill, starting with the first three characteristics of an\n      Expert Generalist.\nmore…"},{"url":"https://archive.ph/mD62Q","last_moved_at":"2025-06-19T19:10:07.666Z","title":"Bruce Ames, 95, Dies; Biochemist Discovered Test for Toxic Chemicals …","summary":"Bruce Ames, a biochemist known for creating the Ames Test to detect cancer-causing chemicals, passed away on October 5 at the age of 95. His test revolutionized safety testing by providing a quick and cheap way to identify toxic substances, leading to the banning of many harmful chemicals. Despite his significant contributions to science, he later expressed skepticism about the risks of some synthetic chemicals, complicating his legacy in the environmental movement."},{"url":"https://readwise.io/reader/document_raw_content/324200585","last_moved_at":"2025-06-19T19:05:06.970Z","title":"A Perspective On The Development Of The Ames Salmonella/Mammalian-Microsome Mutagenicity Assay","summary":"The Ames test, developed by Bruce N. Ames, uses modified Salmonella bacteria to detect chemical mutagens that may also be carcinogens. This assay has been influential in genetic toxicology since the 1970s and involves exposing bacteria to various chemicals to observe mutations. Over the years, the test has been refined to improve sensitivity and remains a popular method for assessing mutagenicity."}]],["18 Jun 2025",[{"url":"https://www.science.org/content/blog-post/ames-test-and-real-world","last_moved_at":"2025-06-18T17:29:39.593Z","title":"The Ames Test and the Real World","summary":"The Ames test shows that both natural and synthetic compounds can be toxic, emphasizing that \"the dose makes the poison.\" Many foods, especially plants, contain natural substances that can be harmful in large amounts, but our bodies usually detoxify these compounds. Instead of worrying about small amounts of synthetic chemicals, we should focus on more significant health risks like smoking and alcohol."}]],["17 Jun 2025",[{"url":"https://readwise.io/reader/document_raw_content/323694304","last_moved_at":"2025-06-17T22:18:05.857Z","title":"The Ames Salmonella / Microsome Mutagenicity Assay","summary":"In toxicity assays, it is crucial to use the same number of bacteria for accurate results. Diluting the tester strain to fewer than 1000 cells can lead to incorrect conclusions about toxicity. More bacteria exposed to a chemical allows for better assessment of its effects."}]],["16 Jun 2025",[{"url":"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(04)16878-5/fulltext","last_moved_at":"2025-06-16T17:03:38.380Z","title":"Edward B Lewis","summary":"Edward B. Lewis was a geneticist who won the Nobel Prize in 1995 for his groundbreaking work on how genes control embryonic development. He also studied the effects of radiation on cancer, which led to controversy and public scrutiny. Throughout his life, he was dedicated to research and understanding the laws of nature, remaining an active lab scientist until his passing in 2004."},{"url":"https://blog.exitgroup.us/p/cheap-drones-will-realize-the-promise?__readwiseLocation=","last_moved_at":"2025-06-16T08:52:10.003Z","title":"Drones will realize the promise of suicide terrorism","summary":"Recent drone attacks by Mossad and Ukraine have shown how drones can effectively neutralize military targets and disrupt economies. These attacks highlight a shift in warfare, where even low-cost drone strikes can threaten large, established powers. As drone technology becomes more accessible, it may lead to a new geopolitical order, diminishing the dominance of traditional military forces."},{"url":"https://readwise.io/reader/document_raw_content/322025509","last_moved_at":"2025-06-16T09:25:10.253Z","title":"Ch 9 - Epidemiology | Core Psychiatry","summary":"Epidemiology studies how health-related issues affect populations and aims to control health problems. It involves various research designs, including descriptive and analytical studies, to measure disease prevalence and incidence. In psychiatric epidemiology, researchers assess mental health through validated measures that consider demographic, socioeconomic, and health status factors."}]],["15 Jun 2025",[{"url":"https://www.joelonsoftware.com/2002/06/12/strategy-letter-v/","last_moved_at":"2025-06-15T16:41:45.243Z","title":"Strategy Letter V","summary":"In the tech industry, companies often invest in open source software as a smart business strategy to make complementary products cheaper. This approach helps drive demand for their main products, like operating systems and hardware. Ultimately, these companies aim to commoditize software and hardware to increase sales and profits."}]],["14 Jun 2025",[{"url":"https://archive.ph/BA5dh","last_moved_at":"2025-06-14T19:29:35.884Z","title":"Houthi attacks on shipping in Red Sea threaten global consequences - …","summary":"Houthi attacks in the Red Sea are disrupting global shipping, prompting BP to halt shipments through the area. These attacks, which are partly in response to the conflict in Gaza, threaten to escalate tensions and impact trade significantly. As shipping firms reroute to avoid danger, oil prices are rising, raising concerns about further economic consequences."},{"url":"https://x.com/PatrickJBlum/status/1929284675903570121/?rw_tt_thread=True","last_moved_at":"2025-06-14T19:31:11.968Z","title":"The Trojan Truck: How Ukraine Just Made Nowhere Safe","summary":"Ukraine used disguised delivery trucks to launch drones that destroyed over forty Russian aircraft, including key bombers. This attack shows that no Russian asset is truly safe, forcing Russia to treat every civilian vehicle as a potential threat. The operation highlights a new kind of warfare where civilian infrastructure can be weaponized, creating ongoing challenges for Russia and other nations."}]],["13 Jun 2025",[{"url":"https://borretti.me/article/notes-on-managing-adhd","last_moved_at":"2025-06-13T17:27:09.059Z","title":"Notes on Managing ADHD","summary":"The text provides strategies for managing ADHD, emphasizing the importance of using a todo list to form habits and stay organized. It suggests journaling for introspection and understanding procrastination patterns, while also recommending centralizing tasks to avoid distractions. Finally, it highlights the need to control the environment and minimize interruptions to enhance productivity."}]],["12 Jun 2025",[{"url":"https://scottaaronson.blog/?p=8908","last_moved_at":"2025-06-12T09:19:30.448Z","title":"Guess I’m A Rationalist Now","summary":"Scott attended a rationalist blogging conference called LessOnline, where he met familiar and new faces. After years of hesitation, he finally embraced the label of \"Rationalist,\" despite previously feeling out of place in the community. He reflects on the growth and evolution of Rationalism, acknowledging both its appeal and the criticisms it faces."}]],["10 Jun 2025",[{"url":"https://dcurt.is/thinking","last_moved_at":"2025-06-10T18:31:53.746Z","title":"Thoughts on thinking","summary":"The author feels stuck and believes that their creative efforts are overshadowed by AI's ability to produce better ideas quickly. They reflect on how using AI has diminished their own thinking and intellectual growth, despite having access to more information than ever. Ultimately, they feel that relying on AI is more like sedation than real mental exercise, even as they continue to share their thoughts."},{"url":"https://www.thecrimson.com/article/2025/5/23/harvard-international-students-trump/","last_moved_at":"2025-06-10T10:28:03.304Z","title":"Harvard’s International Students Are People — Not Pawns","summary":"The Department of Homeland Security has revoked Harvard's ability to host international students, leaving many in uncertainty about their futures. This decision is seen as a political attack, harming talented individuals who contribute to the campus and the country. Harvard plans to take legal action, but the editorial board urges other universities to stand in solidarity with its international students."},{"url":"https://slate.com/culture/2010/02/judith-warner-s-we-ve-got-issues.html","last_moved_at":"2025-06-10T10:23:32.570Z","title":"We’ve Got Issues","summary":"Journalism often tells stories to explain human behavior, but true science seeks to uncover new causal explanations behind our actions. Alison Gopnik critiques Judith Warner’s book for prioritizing narratives over scientific evidence when discussing the use of drugs for children's psychological issues. She emphasizes that while stories can engage us, scientific evidence is crucial for understanding and addressing complex problems effectively."},{"url":"https://www.latimes.com/archives/la-xpm-1991-02-10-tm-1474-story.html","last_moved_at":"2025-06-10T22:56:06.375Z","title":"LIFE IN THE LAB","summary":"The author reflects on her family's struggle with Huntington's disease, revealing that her mother and uncles were affected by this hereditary illness. After her mother’s diagnosis, the family formed the Hereditary Disease Foundation to support research and awareness. The author finds purpose in fighting against the disease while grappling with its impact on her life."},{"url":"https://thomwolf.io/blog/scientific-ai.html","last_moved_at":"2025-06-10T18:31:15.711Z","title":"🔭 The Einstein AI model","summary":"The author argues that AI will not lead to rapid scientific breakthroughs as predicted, but will instead produce obedient models that reinforce existing knowledge. True progress in science comes from asking bold questions and challenging established ideas, rather than simply answering known ones. To achieve real innovation, AI should be encouraged to think critically and explore new concepts beyond its training data."}]],["09 Jun 2025",[{"url":"https://every.to/thesis/knowledge-work-is-dying-here-s-what-comes-next","last_moved_at":"2025-06-09T18:23:21.583Z","title":"Knowledge Work Is Dying — Here’s What Comes Next","summary":"AI is replacing knowledge-based jobs, making emotional clarity, discernment, and connection essential skills for the future. As expertise becomes less valuable, wisdom work will become more important in leadership and teamwork. Success will depend on how well we manage relationships and emotions, rather than just our knowledge."},{"url":"https://worksinprogress.co/issue/the-bad-science-behind-expensive-nuclear/","last_moved_at":"2025-06-08T23:34:59.472Z","title":"The bad science behind expensive nuclear","summary":"The Linear No Threshold (LNT) model suggests that any amount of radiation increases cancer risk, leading to strict safety regulations that make nuclear power expensive. This theory, initially based on studies of fruit flies and influenced by political agendas, is now being questioned by some scientists. New research indicates that there may be thresholds for radiation harm, challenging long-held beliefs about its risks."},{"url":"https://archive.ph/ofxzl","last_moved_at":"2025-06-09T18:33:59.953Z","title":"Rampant AI Cheating Is Ruining Education Alarmingly Fast","summary":"Many college students, like Chungin “Roy” Lee at Columbia University, are using AI tools like ChatGPT to complete assignments, often relying on them for a significant portion of their work. This widespread cheating raises concerns about students' learning and critical-thinking skills, leading to fears that many graduates may lack essential competencies for the workforce. Educators worry that the reliance on AI undermines the value of education and the intellectual growth that colleges are supposed to provide."},{"url":"https://archive.ph/lBeyj","last_moved_at":"2025-06-08T23:32:40.784Z","title":"Why robots are not the answer to US manufacturing reshoring hopes","summary":"Robots are not the solution to the US manufacturing reshoring challenges due to high costs, skilled worker shortages, and complex integration issues. Many manufacturers face barriers like limited budgets and changing product lines, making automation less feasible. Additionally, the lack of a national robotics strategy and strong labor union opposition complicate efforts to increase automation in factories."}]],["04 Jun 2025",[{"url":"https://www.nytimes.com/2011/04/17/magazine/mag-17cellphones-t.html?_r=1&pagewanted=all","last_moved_at":"2025-06-04T19:12:21.772Z","title":"Do Cellphones Cause Brain Cancer? - The New York Times","summary":"The link between cellphones and brain cancer is still unclear, as studies show mixed results. While some suggest regular cellphone use may lower the risk of tumors, others indicate high usage could increase risk for specific types. Overall, current evidence does not convincingly prove that cellphone radiation causes cancer."},{"url":"https://stratechery.com/2025/american-disruption/","last_moved_at":"2025-06-04T08:05:55.577Z","title":"American Disruption","summary":"The article discusses the negative impact of President Trump's trade policies on the tech industry, particularly regarding tariffs that hurt demand and disrupt supply chains. It highlights the shift from the U.S. manufacturing model to Asian manufacturing, emphasizing the need for targeted tariffs that encourage domestic production without harming the overall market. Ultimately, the author argues for a more strategic approach to trade that focuses on innovation and cooperation rather than blanket tariffs."}]],["03 Jun 2025",[{"url":"https://www.nytimes.com/2025/03/10/opinion/covid-public-health-privatization.html","last_moved_at":"2025-06-02T23:30:36.536Z","title":"Opinion | Covid’s Deadliest Effect Took Five Years to Appear - The New York Times","summary":"Covid-19 has changed how we approach public health, shifting responsibility from government to private entities. This privatized model has weakened trust in scientific authorities and public health systems. As a result, future responses to pandemics may lack the necessary oversight and coordination needed to protect communities."},{"url":"https://www.astralcodexten.com/p/tegmarks-mathematical-universe-defeats","last_moved_at":"2025-06-02T23:13:19.820Z","title":"Tegmark's Mathematical Universe Defeats Most Proofs Of God's Existence","summary":"Max Tegmark's mathematical universe hypothesis claims that all possible mathematical objects exist, which challenges traditional proofs for God's existence. This theory suggests that conscious beings can arise from simple mathematical rules, making the universe's complexity a natural outcome rather than a divine creation. The author argues that this perspective provides alternative explanations for key arguments that support the existence of God."}]],["02 Jun 2025",[{"url":"https://benthams.substack.com/p/the-fine-tuning-argument-simply-works","last_moved_at":"2025-06-02T18:11:59.863Z","title":"The Fine-Tuning Argument Simply Works","summary":"The fine-tuning argument suggests that the universe is precisely set up for life, indicating the possibility of a designer, or God. Critics argue that a multiverse could explain this fine-tuning, but this idea also faces significant challenges, such as the likelihood of creating interesting universes. Ultimately, the fine-tuning observation supports the existence of a God rather than a naturalistic explanation."},{"url":"https://mileskdonahue.substack.com/p/my-doubts-about-the-fine-tuning-argument","last_moved_at":"2025-06-02T18:11:51.609Z","title":"My Doubts about the Fine-Tuning Argument","summary":"Miles K. Donahue expresses doubts about the fine-tuning argument for God's existence, highlighting that we lack a complete theory of physics and cannot assume future physics will also show fine-tuning. He questions whether we are in the right position to evaluate the hypotheses of theism versus naturalism, suggesting there may be many unexplored alternatives. Additionally, he challenges the assumption that a fine-tuned universe is more likely under theism than naturalism, citing unresolved issues in divine psychology."}]],["28 May 2025",[{"url":"https://every.to/context-window/google-s-ai-vision-make-tech-human-again","last_moved_at":"2025-05-28T18:29:40.615Z","title":"Google’s AI Vision: Make Tech Human Again","summary":"The company’s hurricane of AI product releases at Google I/O adds up to a clear vision for AGI and for humanity."},{"url":"https://epoch.ai/gradient-updates/most-ai-value-will-come-from-broad-automation-not-from-r-d","last_moved_at":"2025-05-27T23:01:06.531Z","title":"Most AI value will come from broad automation, not from R&D","summary":"Most of the economic value from AI will come from broad automation across various jobs, rather than just improving research and development (R&D). While R&D is important, it contributes less to economic growth than many believe. Therefore, we should expect AI to first automate routine jobs before transforming areas like science and technology."}]],["27 May 2025",[{"url":"https://www.nature.com/articles/d41586-021-02736-8","last_moved_at":"2025-05-27T22:56:44.064Z","title":"The Definition of Gene Therapy Has Changed","summary":"Gene therapy is becoming a promising treatment for various diseases, evolving from just delivering healthy genes to also repairing existing ones. New techniques, like using nanoparticles for gene editing, are making therapies safer and more effective. Despite challenges, gene therapy is gaining recognition in modern medicine, with several products already approved for use."}]],["24 May 2025",[{"url":"https://www.righto.com/2011/07/cells-are-very-fast-and-crowded-places.html?m=1","last_moved_at":"2025-05-24T18:04:43.888Z","title":"Cells are very fast and crowded places","summary":"Cells are incredibly crowded and busy, resembling a packed Times Square rather than an open park. Molecules inside cells move at astonishing speeds, with some traveling as fast as 250 miles per hour. This rapid movement helps them find the right places to interact, making cellular processes efficient and dynamic."},{"url":"https://jsomers.net/i-should-have-loved-biology/","last_moved_at":"2025-05-24T17:55:32.768Z","title":"I should have loved biology","summary":"The author reflects on how high school biology felt dull and focused on memorizing terms instead of exploring the wonders of life. He later realized that understanding biology involves seeing cells as complex machines with intricate functions. The text emphasizes the importance of learning through methods and visualization to truly grasp biological concepts."},{"url":"https://nehalslearnings.substack.com/p/i-should-have-loved-biology-too","last_moved_at":"2025-05-24T18:43:36.572Z","title":"I should have loved biology too","summary":"The author, Nehal Udyavar, shares how great writing transformed their view of biology from boredom to fascination. Inspired by books like \"The Sixth Extinction,\" they realized biology is full of exciting stories and discoveries. Now, they aim to make complex biological concepts accessible and inspiring for everyone."},{"url":"https://www.nytimes.com/2025/04/19/opinion/extinction-technology-culture.html","last_moved_at":"2025-05-24T10:23:33.850Z","title":"Opinion | Come With Me if You Want to Survive an Age of Extinction - The New York Times","summary":"The digital age is creating a \"bottleneck\" that threatens traditional cultures, art forms, and even human reproduction. As people become distracted by virtual experiences, they may lose touch with real-life connections and skills. To survive this crisis, we must intentionally engage in the things we love and resist the pull of the virtual world."},{"url":"https://archive.ph/ZJdo7","last_moved_at":"2025-05-24T10:22:32.301Z","title":"Opinion | Jeff Bezos: The hard truth: Americans don’t trust the news …","summary":"Jeff Bezos highlights the declining trust in media, noting that journalists are now seen as less credible than Congress. He argues that to regain trust, media outlets should stop endorsing presidential candidates, as it creates a perception of bias. Bezos emphasizes the need for credible and independent journalism to combat misinformation and serve the public effectively."},{"url":"https://archive.ph/1VmIh","last_moved_at":"2025-05-24T10:13:59.304Z","title":"Facebook Offers Life Raft, but Publishers Are Wary - The New York Tim…","summary":"Facebook has become a major player in publishing, attracting over 1.3 billion users and promoting high-quality content. However, traditional publishers are wary of relying too much on Facebook, fearing it could control their content and audience data. While Facebook aims to collaborate with publishers to enhance mobile experiences, many remain concerned about losing their independence and the future of journalism."},{"url":"https://www.construction-physics.com/p/robot-dexterity-still-seems-hard","last_moved_at":"2025-05-24T10:13:05.429Z","title":"Robot Dexterity Still Seems Hard","summary":"Humanoid robots are making progress in movement, but they still struggle with dexterity, which is crucial for real-world tasks. While some robots can perform specific actions, they often lack the flexibility and precision that humans have. Overall, creating robots that can manipulate objects like a person remains a significant challenge."}]],["21 May 2025",[{"url":"https://www.henrikkarlsson.xyz/p/friends-missed","last_moved_at":"2025-05-21T14:26:57.060Z","title":"Sometimes the reason you can’t find people you resonate with is because you misread the ones you meet","summary":"Sometimes, we misread people and fail to see their true potential for friendship. The author reflects on how he overlooked his close friend Torbjörn for years, focusing only on superficial traits. Genuine connections often require us to engage deeply and recognize the character and virtues of others."},{"url":"https://arstechnica.com/gadgets/2025/04/a-history-of-the-internet-part-1-an-arpa-dream-takes-form/?__readwiseLocation=","last_moved_at":"2025-05-21T08:12:31.540Z","title":"A history of the Internet, part 1: An ARPA dream takes form","summary":"The Internet began as a solution to connect multiple computers in an office, driven by the idea of sharing resources. It evolved with the development of packet switching and the Transmission Control Protocol (TCP), allowing different networks to communicate. Over time, the ARPANET transitioned to TCP/IP, marking a significant step in the growth of the Internet."}]],["20 May 2025",[{"url":"https://readwise-assets.s3.amazonaws.com/media/wisereads/articles/how-to-mark-a-book/how-to-mark-a-book-1.pdf","last_moved_at":"2025-05-20T09:25:23.354Z","title":"How To Mark A Book","summary":"In this article, Mortimer J. Adler argues that marking up a book is crucial to effective and active reading. He contends that marking a book is not an act of mutilation but of love, and that owning a book means making it a part of oneself. Adler suggests various ways to mark a book, such as underlining, circling, or writing in the margins, and emphasizes the benefits of doing so, including better understanding, memory retention, and engagement in a conversation with the author. Finally, he addresses potential objections to marking books, such as lending them to friends, and suggests solutions."}]],["13 May 2025",[{"url":"https://stratechery.com/2024/a-chance-to-build/","last_moved_at":"2025-05-13T09:31:12.414Z","title":"A Chance to Build","summary":"Silicon Valley's success is closely tied to semiconductors, which are made in Asia due to lower labor costs. As the U.S. dominates software development, China excels in hardware manufacturing, creating a strong economic partnership. However, rising tariffs could threaten this balance and limit opportunities for software companies."}]],["12 May 2025",[{"url":"https://nadia.xyz/idea-machines","last_moved_at":"2025-05-12T17:10:06.811Z","title":"Idea machines","summary":"Effective altruism (EA) serves as a model for understanding various influential tech subcultures by acting as an \"Idea Machine\" that transforms ideas into outcomes. Modern idea machines, which are less centralized than traditional foundations, can attract communities and generate agendas to drive change. More idea machines are beneficial because they offer diverse opportunities for people with good ideas to find support beyond just effective altruism."}]],["11 May 2025",[{"url":"https://www.construction-physics.com/p/who-wins-nobel-prizes","last_moved_at":"2025-05-11T18:13:00.331Z","title":"Who Wins Nobel Prizes?","summary":"The Nobel Prizes have been awarded since 1901 and show trends in scientific progress and research locations. Most prizes are won by individuals from the US, UK, and Germany, affiliated with elite institutions, but many countries and schools also contribute to prize-winning work. Despite the concentration in certain areas, a wide range of places and backgrounds have produced Nobel Prize winners."},{"url":"https://www.nytimes.com/interactive/2018/11/15/magazine/tech-design-ai-prediction.html","last_moved_at":"2025-05-11T17:53:28.399Z","title":"The Human Brain Is a Time Traveler","summary":"The human brain has a unique ability to imagine the past and future, which researchers call cognitive time travel. This skill is linked to our intelligence and helps us learn from experiences and make decisions. Advances in technology and storytelling may enhance this ability, allowing us to better predict future outcomes."}]],["09 May 2025",[{"url":"https://press.asimov.com/articles/dna-information","last_moved_at":"2025-05-09T13:10:58.683Z","title":"How Much Information is in DNA?","summary":"DNA contains a large amount of information, with estimates suggesting it could represent around 212 billion different patterns. Most human DNA is nearly identical, allowing for significant compression of genetic data, which can reduce it by over 99 percent with reference genomes. However, the exact amount of useful information in our DNA is still unclear, as much of it may be crucial for functions we do not fully understand."},{"url":"https://press.asimov.com/articles/family-future","last_moved_at":"2025-05-08T23:10:16.112Z","title":"Healing My Family’s Future","summary":"The author inherited a mutated CDH1 gene linked to hereditary stomach cancer and faced difficult decisions about genetic testing and surgery. They chose in vitro fertilization with pre-implantation genetic testing to ensure their children would not inherit the mutation. This journey has transformed their understanding of family health and the benefits of genetic knowledge."}]],["08 May 2025",[{"url":"https://stratechery.com/2025/microsoft-earnings-microsofts-core-capability-amazon-earnings/","last_moved_at":"2025-05-08T08:15:30.154Z","title":"Microsoft Earnings, Microsoft’s Core Capability, Amazon Earnings","summary":"Microsoft and Amazon are taking different approaches to artificial intelligence that highlight their unique strengths. Stratechery offers a range of content, including updates and podcasts, for subscribers interested in technology analysis. Subscriptions are available for individuals or teams, and they can be managed easily online."}]],["06 May 2025",[{"url":"https://kucharski.substack.com/p/possibly-a-serious-possibility?__readwiseLocation=","last_moved_at":"2025-05-06T11:08:49.292Z","title":"Possibly a serious possibility","summary":"Sherman Kent, a CIA analyst, faced confusion over the phrase \"serious possibility\" in a report about a potential Soviet invasion of Yugoslavia, which was interpreted differently by his colleagues. This highlighted a larger issue in intelligence communication, where ambiguous language led to misunderstandings about probability. To address this, some governments have since standardized terms to improve clarity and reduce the risk of misinterpretation."},{"url":"https://archive.ph/pkh6g","last_moved_at":"2025-05-06T10:13:55.870Z","title":"How to Read a Book a Week","summary":"To read a book a week, focus on understanding the main ideas rather than reading every word. Start by learning about the author, reading the introduction and conclusion, and skimming through chapters to grasp the arguments. Engaging actively with the material helps you retain more information and makes reading faster and more enjoyable."},{"url":"https://x.com/karpathy/status/1909308143156240538/?rw_tt_thread=True","last_moved_at":"2025-05-06T10:00:23.687Z","title":"Power to the people: How LLMs flip the script on technology diffusion","summary":"LLMs like ChatGPT are changing technology use by empowering everyday people instead of just corporations and governments. They offer broad, accessible capabilities at low cost, allowing individuals to do things they couldn't do before. While organizations face challenges in adopting LLMs due to complexity and bureaucracy, individuals are experiencing significant benefits."},{"url":"https://www.techdirt.com/2025/03/04/why-techdirt-is-now-a-democracy-blog-whether-we-like-it-or-not/","last_moved_at":"2025-05-06T09:43:46.538Z","title":"Why Techdirt Is Now A Democracy Blog (Whether We Like It Or Not)","summary":"Techdirt has shifted its focus to cover the threats against democracy posed by the consolidation of power in the tech industry. The dismantling of American institutions is seen as a major risk to innovation and civil liberties. As tech leaders pursue personal power, understanding the intersection of technology and democracy becomes critical for the future."}]],["04 May 2025",[{"url":"https://blog.jovono.com/p/book-review-abundance-by-ezra-klein","last_moved_at":"2025-05-04T11:08:42.429Z","title":"Book Review: Abundance by Ezra Klein and Derek Thompson","summary":"The book \"Abundance\" by Ezra Klein and Derek Thompson critiques progressive policies that prioritize funding without ensuring results, suggesting a shift towards a mindset of delivering tangible outcomes. It argues that true abundance requires addressing broader economic issues, not just regulatory changes, to create opportunities for everyone. However, the authors seem hesitant to fully break from traditional progressive views, limiting their proposed solutions."}]],["01 May 2025",[{"url":"https://blog.jovono.com/p/ballmer-microsoft-underrated","last_moved_at":"2025-05-01T10:24:41.893Z","title":"Is Steve Ballmer the Most Underrated CEO of the 21st Century?","summary":"Steve Ballmer, former CEO of Microsoft, is often criticized for his leadership, particularly during a time when the company's stock fell and it struggled with product innovation. Despite this, he made some smart business decisions that laid the groundwork for future success, such as embracing cloud computing and supporting diverse revenue streams. While not seen as a visionary, Ballmer's operational skills and initiatives helped shape the company, leading some to argue that he is the most underrated CEO of the 21st century."},{"url":"https://marginalrevolution.com/marginalrevolution/2025/02/three-simple-principles-of-trade-policy.html","last_moved_at":"2025-05-01T09:26:23.839Z","title":"Three Simple Principles of Trade Policy","summary":"Alex Tabarrok discusses three key principles of trade policy. First, taxes on imports also affect exports, showing that both are interconnected. Second, businesses consume more imports than households, highlighting trade-offs in job creation across different sectors. Lastly, trade imbalances are linked to capital flows, meaning addressing trade deficits requires balancing domestic savings and investment."},{"url":"https://www.newyorker.com/magazine/2025/04/14/blueskys-quest-to-build-nontoxic-social-media?__readwiseLocation=","last_moved_at":"2025-05-01T19:53:47.621Z","title":"Bluesky’s Quest to Build Nontoxic Social Media | The New Yorker","summary":"Bluesky, launched in early 2023, has quickly grown to over ten million users, attracting those seeking a healthier social media experience away from Twitter. It operates on an open-source protocol, allowing users to customize their feeds and moderation rules. CEO Jay Graber aims to create a decentralized platform that remains resilient against corporate control, emphasizing user freedom and adaptability."},{"url":"https://archive.ph/vPyGD","last_moved_at":"2025-05-01T16:26:21.756Z","title":"How to Unleash the Potential of New Energy Technology","summary":"Hydrogen is emerging as a key solution to combat climate change, with many countries investing in green hydrogen production to reduce carbon emissions. This clean fuel can be produced from renewable energy sources and has potential applications in various industries. However, challenges such as infrastructure and regulatory needs must be addressed to scale up its use effectively."}]],["30 Apr 2025",[{"url":"https://archive.ph/GQwYI","last_moved_at":"2025-04-30T18:47:12.948Z","title":"Why can’t stinking rich Ivies cope with losing a few hundred million?","summary":"Wealthy universities like Columbia struggle to access their large endowments when facing financial challenges. Federal funding is crucial for their budgets, and new government rules could worsen their financial situations. Despite their billions in endowments, many of these funds are tied up and cannot be easily used to cover unexpected losses."}]],["29 Apr 2025",[{"url":"private://read/01jt166m55hz7mezh69raw8b7f","last_moved_at":"2025-04-29T16:31:35.108Z","title":"The Long Way to a Small, Angry Planet","summary":"Ashby is busy with work and can't show Rosemary the ropes right away, but he plans to help her once the job is done. Sissix feels the need to explain things to her crewmates while Kizzy confidently prepares for a dangerous task. Ashby, concerned about the situation, realizes his crew is facing challenges and wonders what has happened to their missing teammate, Jenks."},{"url":"https://www.theatlantic.com/magazine/archive/2024/11/the-elite-college-students-who-cant-read-books/679945/","last_moved_at":"2025-04-29T15:42:42.701Z","title":"The Elite College Students Who Can’t Read Books","summary":"Many elite college students struggle to read long books because their high schools have shifted to shorter texts and excerpts. This change has left them unprepared for the heavy reading loads in college courses. As a result, professors are lowering their expectations and assigning less reading."},{"url":"https://readwise.io/reader/document_raw_content/296859141","last_moved_at":"2025-04-29T19:59:22.286Z","title":"A Tale of Two Repressors","summary":"The lac repressor and λ repressor are key proteins that significantly advanced our understanding of gene regulation in bacteria. They function by binding to specific DNA sites, blocking transcription and allowing coordinated control of gene expression. Their structures and interactions illustrate how proteins regulate metabolic processes and maintain cellular functions."},{"url":"http://www.paulgraham.com/vb.html","last_moved_at":"2025-04-29T16:25:18.340Z","title":"Life is Short","summary":"Life is short, and having children made the author realize how limited our time really is. He emphasizes the importance of avoiding pointless activities and focusing on what truly matters. To make the most of our time, we should not wait to pursue meaningful experiences and should savor every moment we have."},{"url":"https://stratechery.com/2014/publishers-smiling-curve/","last_moved_at":"2025-04-29T21:58:48.461Z","title":"Publishers and the Smiling Curve","summary":"The \"Smiling Curve\" concept illustrates that in industries like publishing, most value goes to content aggregators like Facebook and Google, while traditional publishers struggle in the middle. As readers increasingly consume news through these platforms, publishers lose their unique value and face financial challenges. To thrive, successful writers and publications must focus on their strengths and adapt, similar to specialized companies that excel in niche markets."}]],["28 Apr 2025",[{"url":"https://www.figma.com/blog/realtime-editing-of-ordered-sequences/","last_moved_at":"2025-04-28T13:44:45.967Z","title":"Realtime Editing of Ordered Sequences","summary":"Figma faced challenges with real-time editing of ordered sequences when adding multiplayer features. Instead of using the complex Operational Transformation method, they implemented fractional indexing to simplify reordering and maintain consistency. This approach makes editing easier and allows for faster development of new features."}]],["24 Apr 2025",[{"url":"https://www.sciencedirect.com/science/article/abs/pii/S0022283611001689","last_moved_at":"2025-04-24T09:31:45.512Z","title":"A Tale of Two Repressors","summary":"The discovery of the operon by Monod and Jacob revolutionized gene regulation in molecular biology. They identified how repressors control enzyme production in bacteria, particularly in lactose metabolism and phage development. Their work established a model for how genes are turned on and off in response to environmental signals."}]],["21 Apr 2025",[{"url":"https://commoncog.com/the-3-kinds-of-non-fiction-book/#branchbooks","last_moved_at":"2025-04-21T11:01:00.618Z","title":"The three kinds of non-fiction books","summary":"There are three types of non-fiction books: narrative, tree, and branch. Narrative books tell stories, tree books provide a framework of ideas, and branch books focus on a single idea with examples. Understanding these categories helps readers choose books wisely and read them effectively."},{"url":"https://commoncog.com/g/burnout/#what-is-the-opposite-of-burnout","last_moved_at":"2025-04-21T10:58:10.191Z","title":"The Ultimate Burnout Guide: Symptoms, Causes, and Prevention","summary":"Burnout is a psychological state caused by prolonged job stress, characterized by exhaustion, cynicism, and feelings of ineffectiveness. It is influenced by social and organizational factors, not just individual experiences. Preventing burnout requires a supportive work environment with adequate resources to balance high job demands."}]],["20 Apr 2025",[{"url":"https://theahura.substack.com/p/tech-things-openai-buys-windsurf","last_moved_at":"2025-04-20T17:06:00.922Z","title":"Tech things: OpenAI buys Windsurf, Google retains its lead, and where the hell is Apple?","summary":"OpenAI's acquisition of Windsurf raises questions about their strategy, especially given their financial constraints and competition from Google. The AI market is crowded, and companies like OpenAI need access to data and computing power to succeed. Google's dominance in AI tools and their continued innovation put pressure on other players, making it challenging for them to compete."}]],["17 Apr 2025",[{"url":"https://x.com/Molson_Hart/status/1908940952908996984/?rw_tt_thread=True","last_moved_at":"2025-04-17T08:43:02.209Z","title":"America Underestimates the Difficulty of Bringing Manufacturing Back","summary":"Bringing manufacturing back to the U.S. is more complicated than just imposing tariffs, which may actually harm the economy. The high costs of labor, lack of infrastructure, and uncertainty around tariffs make it difficult for American companies to compete with countries like China. To succeed, the U.S. needs to create better conditions for manufacturing rather than rushing into poorly structured policies."},{"url":"https://stratechery.com/2025/trade-tariffs-and-tech/","last_moved_at":"2025-04-17T08:44:02.152Z","title":"Trade, Tariffs, and Tech","summary":"The complexity of global supply chains is crucial to modern life, and disruptions can lead to significant economic consequences, as seen during COVID and recent tariff actions. The U.S. has relied on China's manufacturing and trade surplus, which has affected its fiscal stability and trade balance. Efforts to restructure these economic relationships, like tariffs, could have drastic impacts on both U.S. companies and the global economy."}]],["16 Apr 2025",[{"url":"https://davidgraeber.org/articles/on-the-phenomenon-of-bullshit-jobs-a-work-rant/","last_moved_at":"2025-04-16T10:32:33.833Z","title":"On the Phenomenon of Bullshit Jobs: A Work Rant","summary":"Technology has advanced, but we work more instead of less. Many people have jobs they feel are pointless and unnecessary. Society values certain jobs over others, creating resentment and inequality in the workforce."}]],["15 Apr 2025",[{"url":"https://jimhorton.substack.com/p/the-nonwriters-guide-to-writing-a?utm_source=multiple-personal-recommendations-email&utm_medium=email&triedRedirect=true","last_moved_at":"2025-04-15T09:20:59.921Z","title":"The Nonwriter's Guide to Writing A Lot","summary":"James Horton’s guide emphasizes that many people struggle to write because they impose unrealistic expectations on themselves. To overcome this, he suggests writing freely and frequently, without worrying about perfection or importance. By shifting the focus to enjoyable and exploratory writing, individuals can build a sustainable writing habit."}]],["12 Apr 2025",[{"url":"https://www.founderstribune.org/p/the-disapproval-of-the-crowd-by-alex-karp","last_moved_at":"2025-04-12T00:03:09.005Z","title":"The Disapproval of the Crowd by Alex Karp","summary":"Alex Karp argues that modern culture's emphasis on likability and conformity stifles creativity and innovation. He reflects on how the fear of disapproval can hinder individuals and organizations from pursuing new ideas. True progress requires resilience and a willingness to challenge established norms, much like artists and founders who break away from the crowd."},{"url":"https://adjacentpossible.substack.com/p/condensing-the-iceberg","last_moved_at":"2025-04-11T23:59:28.765Z","title":"Condensing The Iceberg","summary":"The concept of the \"attention economy\" highlights how information competes for our focus, as described by Herbert Simon. Steven Johnson reflects on how modern tools, like smartphones and social media, help condense vast amounts of information into digestible bits, but also challenge our ability to engage with longer texts. Ultimately, the skill of condensing information is crucial for both writers and consumers in our information-rich world."}]],["10 Apr 2025",[{"url":"https://www.michaeldean.site/p/the-secret-architecture-of-great?r=1gvqcg&utm_medium=ios&triedRedirect=true","last_moved_at":"2025-04-10T08:09:57.651Z","title":"The secret architecture of great essays","summary":"Michael Dean reflects on his experience in architecture school under the tough professor Tootzi, who taught him that great work speaks for itself and emphasized the importance of understanding fundamental patterns. Dean connects these lessons to essay writing, arguing that there is a hidden architecture behind great essays that writers should learn to master. He aims to create a comprehensive guide to these patterns, helping writers improve their craft and connect with readers effectively."}]],["05 Apr 2025",[{"url":"https://blog.rootsofprogress.org/where-is-my-flying-car","last_moved_at":"2025-04-04T23:18:45.848Z","title":"Progress, stagnation, and flying cars","summary":"The book \"Where Is My Flying Car?\" explores the reasons we don't have flying cars yet, concluding that cultural and political barriers, rather than technological ones, are to blame. It highlights the untapped potential of technologies like nanotech and nuclear power, suggesting we could have made significant advancements if work had continued. The author advocates for a renewed vision of progress, emphasizing the need to embrace bold technological possibilities for a better future."}]],["03 Apr 2025",[{"url":"https://www.themarginalian.org/2021/12/20/four-thousand-weeks-oliver-burkeman/","last_moved_at":"2025-04-03T16:48:36.252Z","title":"Against the Trap of Efficiency: The Counterintuitive Antidote to the Time-Anxiety That Haunts and Hampers Our Search for Meaning","summary":"Maria Popova discusses Oliver Burkeman's ideas about time and life's limitations in his book, *Four Thousand Weeks*. Burkeman argues that instead of trying to control our time, we should accept our limitations to find more meaning and joy in life. By confronting the reality of our finite existence, we can focus on what truly matters and live more fulfilling lives."},{"url":"https://www.thenewatlantis.com/publications/how-agriculture-system-works","last_moved_at":"2025-04-03T22:12:12.073Z","title":"Breakfast for Eight Billion","summary":"Modern agriculture, known as Farming 2.0, has greatly increased food production through advancements in fertilization, irrigation, and genetics. Despite producing enough food for everyone, hunger persists mainly due to income inequality and poor distribution. The challenge now is to sustain food production while protecting the environment for future generations."}]],["02 Apr 2025",[{"url":"https://www.slowboring.com/p/trumps-war-on-science","last_moved_at":"2025-04-02T14:43:57.906Z","title":"Trump's war on science","summary":"A multi-directional assault on the foundations of American research"}]],["01 Apr 2025",[{"url":"https://www.forbes.com/sites/alanohnsman/2025/03/27/things-are-bad-at-tesla-theyre-about-to-get-much-worse/?__readwiseLocation=","last_moved_at":"2025-04-01T17:34:41.804Z","title":"Things Are Bad At Tesla. They’re About To Get Much Worse.","summary":"Tesla is facing significant declines in sales across major markets, including a 31% drop in California and a 29% fall in China. Competitors, especially Chinese companies like BYD, are rapidly gaining ground by offering better technology and lower prices. As Tesla's brand reputation worsens and its stock plummets, the company's future looks increasingly uncertain."}]],["24 Mar 2025",[{"url":"https://www.theatlantic.com/magazine/archive/2025/05/trump-executive-order-lawlessness-constitutional-crisis/682112/?__readwiseLocation=","last_moved_at":"2025-03-24T10:24:16.118Z","title":"America Is Watching the Rise of a Dual State","summary":"The article discusses Ernst Fraenkel's concept of a \"dual state,\" where a government maintains normal laws for some citizens while creating a parallel zone of lawlessness for others. It warns that similar tactics are emerging in the U.S., particularly under the Trump administration, which could lead to targeted suppression of dissent. The piece emphasizes that while many may remain unaffected, the dangers of such a system can ultimately threaten everyone’s rights."}]],["16 Mar 2025",[{"url":"https://greg210.substack.com/p/this-habit-will-outlast-every-notes","last_moved_at":"2025-03-16T19:52:00.516Z","title":"This Habit Will Outlast Every Notes App","summary":"You don’t need new apps to enhance your creativity; you just need to engage more deeply with what you already have. Writing helps clarify your thoughts and can lead to greater understanding and growth. Start small by setting a timer for two minutes to write one idea, and see how it transforms your thinking."}]],["07 Mar 2025",[{"url":"https://www.natesilver.net/p/elon-musk-and-spiky-intelligence","last_moved_at":"2025-03-07T10:10:10.195Z","title":"Elon Musk and spiky intelligence","summary":"Elon Musk is highly intelligent in some areas but lacks in others, a concept known as \"spiky intelligence.\" While he demonstrates brilliance in his achievements, he also exhibits poor judgment and social skills. It's important to recognize that being smart does not excuse unwise actions or decisions."}]],["24 Feb 2025",[{"url":"https://thewire.in/society/why-do-young-men-migrate/?__readwiseLocation=","last_moved_at":"2025-02-24T15:21:42.424Z","title":"Why Do Young Men Migrate?","summary":"Young men often migrate not due to crisis, but because of success that leads to inequality in their homelands. As societies develop, many young men feel like surplus, with fewer opportunities for work and family, prompting them to seek better lives elsewhere. This desire to migrate reflects a hope for change and the willingness to take risks for survival."}]],["23 Feb 2025",[{"url":"https://www.thenewatlantis.com/publications/we-live-like-royalty-and-dont-know-it","last_moved_at":"2025-02-23T19:50:53.015Z","title":"We Live Like Royalty and Don’t Know It","summary":"The author reflects on how modern middle-class Americans live in luxury compared to historical figures like Thomas Jefferson, who struggled with basic comforts. He emphasizes that many people today are unaware of the complex systems that provide essential services like food, water, and health. The author argues for the importance of understanding these systems to ensure a better future for the next generation."}]]]